update
upgrade

tap phinze/homebrew-cask || true
tap caskroom/homebrew-versions || true
install brew-cask

tap 'caskroom/cask' || true
tap 'caskroom/versions' || true
tap 'homebrew/apache' || true
tap 'homebrew/brewdler' || true
tap 'homebrew/dupes' || true
tap 'homebrew/php' || true
tap 'homebrew/versions' || true
tap 'sanemat/font' || true

brew 'ansible'
brew 'apr'
brew 'apr-util'
brew 'autoconf'
brew 'automake'
brew 'brew-cask'
brew 'cairo'
brew 'cloog'
brew 'ctags'
brew 'czmq'
brew 'faac'
brew 'ffmpeg'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'gmp'
brew 'gobject-introspection'
brew 'grep'
brew 'harfbuzz'
brew 'httpd22'
brew 'icu4c'
brew 'imagemagick'
brew 'isl'
brew 'jpeg'
brew 'lame'
brew 'libevent'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libxml2'
brew 'libyaml'
brew 'mongodb'
brew 'mpfr'
brew 'mysql'
brew 'nkf'
brew 'nodebrew'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'pngquant'
brew 'pyenv'
brew 'python'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ricty', args: ['vim-powerline']
brew 'ruby-build', args: ['HEAD']
brew 'sqlite'
brew 'tmux'
brew 'tree'
brew 'unixodbc'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'zeromq'
brew 'zlib'
brew 'zsh'

cask 'alfred'
cask 'calibre'
cask 'clamxav'
cask 'coteditor'
cask 'crashlytics'
cask 'dropbox'
cask 'evernote'
cask 'filezilla'
cask 'firefox'
cask 'genymotion'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'karabiner'
cask 'kindle'
cask 'kobito'
cask 'macdown'
cask 'macvim-kaoriya'
cask 'screenhero'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text3'
cask 'toggldesktop'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xquartz'
